#+title: Panospuhdistamo Milkilo Seuranta UI
* Hours
| day              | start |   end |    total | note                         |
|------------------+-------+-------+----------+------------------------------|
|                  |       |       |          | <28>                         |
| <2015-01-30 Fri> | 18:00 | 21:00 | 03:00:00 | Planning, App template       |
| <2015-01-31 Sat> | 10:00 | 15:00 | 05:00:00 | Code                         |
| <2015-02-01 Sun> | 10:00 | 13:00 | 03:00:00 | Refactor                     |
| <2015-02-02 Mon> | 21:10 | 22:00 | 00:50:00 | Refactor more                |
| <2015-02-24 Tue> | 12:00 | 16:00 | 04:00:00 | DB ops                       |
| <2015-02-25 Wed> | 17:15 |       |          | Login                        |
|------------------+-------+-------+----------+------------------------------|
|                  |       |       | 15:50:00 |                              |
#+TBLFM: @3$4..@-1$4=$3-$2;T::@3$5..@-1@>$4=vsum(@2$4..@-1$4);T::@>
* Spec (in Finnish)
** Background
Tuore EU direktiivi pakottaa maitotilat puhdistamaan lypsyjärjestelmän likavedet ennen vesistöön päästämistä. Direktiivin noudattamiseksi maitotilat joutuvat investoimaan 15000e arvoisen aktiivilietteen panospuhdistamojärjestelmään

Talon ja karjakeittiön vedet menevät puhdistamoon jonka pieneliökanta (paskansyöjäbakteerit) puhdistavat likaveden +90% puhtaaksi vedeksi, jonka jälkeen vesi voidaan päästää vesistöön.

*** Puhdistamon tekninen toiminta
Puhdistamokaivon lietevettä ilmastetaan pari kertaa päivässä, jolloin se poreilee. Poreilevan sakan lasettua pinnalle jää puhdasta vettä joka lasketaan järveen.

*** Aktiivilietteen laskeutuskoe
Systeemin toimivuuden varmistamiseksi pieneliökantaa (aktiiviliete) seurataan ilmastuksen jälkeisellä aktiivilietteen laskeutumisnopeuden mittauksella.

Käyttäjä tekee mittauksen 4 - 6 vk välein ja normaalisti mittaus kirjataan paperivihkoon.

** Applikaation ominaisuudet
*** Mittaustavan parantaminen
Ideaali tapa olisi jos merkintä olisi mahdollista tehdä minimaalisen mobiiliapplikaation kautta. Applikaatio voisi myös tarjota näkymän mittaushistoriaan.

Mittaushistoriaa olisi myös hyvä pystyä tarkastelemaan PC:llä sekä tekemään siitä tulosteita.

Ideaalisimmassa tapauksessa puhdistamojärjestelmiä rakentava [[http://www.atomar.fi/][Insinööritoimisto Oy Atomar Ab]] näkisi suoraan kaivoasennusten mittaustiedot järjestelmästä.
*** Mittausilmoitukset
Applikaatio ilmoittaa käyttäjälle sähköpostitse kun mittaus tulisi suorittaa, mikäli viimeisimmästä mittauksesta on kulunut tietyn verran aikaa.
* A
Data entry and alerting.
** DONE Refactor client
http://yogthos.net/posts/2014-08-14-Routing-With-Secretary.html
*** DONE Separate NS's
** DONE DB initialization
*** DONE Connection
*** DONE Init tables
*** DONE Constraints
** DONE Login
*** DONE Session handling
*** DONE Users to DB
*** DONE Check login from db
*** DONE Show user sites on dashboard
On initial fetch, return proper data.
** TODO Entry creation
*** DONE Add some data for testing
*** DONE Single entry page
*** Fix validation
**** TODO Setup test that can be run on REPL
** Error messages
** Alerts
*** TODO Query
*** TODO Schedule with cronj
*** TODO Send mail with postal or mailgun api
clojure-cookbook/05_network-io/5-05_sending-email.asciidoc
** Deployment
* Bugs
** Kirkasvesinäyte

* B
Add data viewing utilities etc.
** [#A] Entry update/delete
** [#A] Charts
Cool nvd3 stuff.
Get some data first.
** [#B] UI Tweaks
*** [#B] Localized datepicker
*** [#C] Desktop responsivity
Data entry is optimized for mobile.
Responsive design.
** [#B] Tests
Not critical right now..
** [#B] Multi user management
Currently designed for single user.
Maybe someday there could be more users..
*** Registration
* Notes
** Record types
*** Active silt (entries_active)
ml/l

Measurement range  100 to 1000ml.

Normal measurements are between 100-600ml.

if 400-500 ml, surplus removal

500ml -> jätetään kolmannes
(/ 500 3) = 166

4-6wk
*** Surplus removal (entries_surplus)
if measurement..
*** Ferrosulphate addition (entries_ferrosulphate)
Kilograms

*** Add table ferrosulphate level
50%
Täyttöastemäärä
with measurement
if > 20% do addition
*** Clean water sample (entries_water)
with active measurement

*** Pump usage hours (entries_pump)
Hours

with measurement

## measurement steps
